---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PointFailures.EdgeHostedPointToBeUnhosted
source: html/1af90084-8c60-caf5-47f8-0756bdc83125.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PointFailures.EdgeHostedPointToBeUnhosted Property

A point element in a family was hosted on an edge outside its family and the edge no longer exists. The point will remain placed but with no host.

## Syntax (C#)
```csharp
public static FailureDefinitionId EdgeHostedPointToBeUnhosted { get; }
```